{
    "index":
    {
        "profile": "ore.jpg",
        "skill": "eng_skill_pira.png",
        "portfolio": "ride.png",
        "mail":
        {
            "business": "Business",
            "businessAddress": "katsuofukuoka0225+@gmail.com",
            "private": "Private",
            "privateAddress": "katsuo0225+@icloud.com"
        }
    },
    "profile":
    {
        "basicInfo": "Basic Information",
        "basicInformation":
            {
                "Name": "Katsuya Fukuoka",
                "Birthday": "1998 / 2 / 25",
                "From": "Osaka Japan",
                "School": "Osaka Prefecture University",
                "Major": "Computer Science",
                "Hobby": "Watching Movie, Gamble, Reading, Cycling, Walking",
                "Specialty": "Playing Boxing, Table tennis, Bowling",
                "Quote": "'Don't leave rice and regrets'"
            }
        ,
        "educationalBack": "Educational Background",
        "educationalBackground":
            {
                "2020〜": "Graduate School of Humanities and Sustainable Sciences, Osaka Prefecture University",
                "2016〜2020": "College of Sustainable System Sciences, Osaka Prefecture University",
                "2013〜2016": "Osaka Prefectural Shimizudani High School",
                "2010〜2013": "Okibe Junior High School",
                "2007〜2010": "Okibe Elementary School"
            },
        "back": "Background",
        "background":
            {
                "2020〜": "Web developer in Mango Byte"
            },
        "commu": "Community",
        "community":
            {
                "https://www.mango-byte.com/index-en.html": "Mango Byte",
                "https://ks.mi.s.osakafu-u.ac.jp/": "OPU Seta Laboratory",
                "https://sites.google.com/view/yelsswakate/%E3%83%9B%E3%83%BC%E3%83%A0?authuser=0": "Young Researchers Association on Educational and Learning Support Systems",
                "https://mensa.jp/about.html": "MENSA Japan",
                "https://www.mensa.org": "MENSA International",
                "https://atcoder.jp/": "AtCoder",
                "": "International Youth Empowerment"
            },
        "research":
            {
                "title": "Research",
                "content": "There is a trend in the world to make 'machines' smarter. On the other hand, I want to make 'people' smarter. That's why I'm in the field of educational technology, which uses smart computers (AI) to make humans smarter. I'm particularly interested in human thinking, and there are many opportunities in the real world for requesting creative, critical, and logical thinking. However, educational facilities like measuring thinking ability are not enough. Therefore, I decided to tackle on research in the such field and create a carefully thought out teaching material. During my undergraduate years, I aimed to build an environment for training analogical thinking, which is thought to be in charge of an important role in creative thinking."
            },
        "view":
            {
                "title": "View",
                "content": "One of my inner ambitions is to leave a strong impression on the people around me while I am alive. And I have the following two goals for my immediate future.・Acquiring unique and interesting skills and careers・Joining a company that has an impact on society I want to spend my student life meaningfully in order to achieve these goals."
            }
    },
    "skill":
    {
        "skillSet": "Skills",
        "program": "Programing Language",
        "skillLevel": "Level",
        "languageName": "Name",
        "business": "Work Experience",
        "hobby": "Interest",
        "otherSkill": "Others",
        "type": "Type",
        "skillName": "Name",
        "webServer": "Web Server",
        "textEditor": "Text Editor",
        "programming":
            {
            "business":
            [
                "CSS3, SCSS / Bootstrap4",
                "Javascript(Client) / Vue.js, Nuxt.js",
                "PHP / Laravel",
                "Javascript(Server) / Node.js, Express, NestJS",
                "Python3 / Flask"
            ],
            "hobby":
            [
                "C",
                "Prolog",
                "Lisp"
            ]
        },
        "other":
        {
            "business":
            {
                "Database（RDBMS）": "MySQL",
                "PaaS": "Google Cloud Platform",
                "CMS": "WordPress",
                "VCS": "Git",
                "Shell Script": "Bash",
                "Wiki": "Wiki.js",
                "Image Editor": "Adobe Photoshop",
                "VIdeo Editor": "Adobe Premiere Pro",
                "UI/UX": "Adobe XD",
                "Others": "Docker"
            },
            "hobby":
            {
                "Video Editor": "Filmora9, iMovie"
            },
            "other":
            {
                "Language": "Japanese, English"
            }
        },
        "certificates": "Certificates",
        "certificatesName": "Name",
        "getYear": "Year",
        "certificate":
        {
            "Student English Presentation Contest 1st Prize": "2021",
            "Young Researchers Association on Educational and Learning Support Systems Outstanding Performance Award": "2021",
            "Osaka Prefecture University President's Award for the first term": "2021",
            "Responsible Conduct of Research_RCR Certificate of Completion": "2021",
            "Advanced Centre for Empowerment Certificate of Appreciation": "2021",
            "Manabu Japanese School Certificate of Appreciation": "2021",
            "Concorde International Academy Graduation Certificate": "2021",
            "Entrepreneurial Capabilities Certificate": "2021",
            "EF SET CEFR C1": "2021",
            "Kredo IT school Graduation Certificate": "2020",
            "Informatics": "2020",
            "1st grade Driver's License": "2016"
        },
        "projects": "Projects",
        "projectsName": "Name",
        "joinYear": "Date",
        "project":
        {
            "National Bowling Student Tournament": "2022",
            "Student English Presentation Contest": "2021",
            "Young Researchers Association on Educational and Learning Support Systems Conference": "2021",
            "Cambodia Water Well Production": "2021",
            "Cambodia Rationing in Slums": "2021",
            "M-1 Contest": "2020",
            "Artificial Intelligence based Werewolf": "2018",
            "Sakura Science Plan": "2018"
        }
    },
    "portfolio":
    {
        "webSites": "Web Sites",
        "webSite":
        {
            "katsuyaOfficial": ["https://kf-official.sakura.ne.jp/index.php", "KATSUYA F Official", "HTML / CSS / PHP", "This is my own portfolio site. When appealing myself to others, I often don't have time to talk a lot, so I thought it would be good if I could pass one URL of this site. I was conscious of it being colorful and easy to see, but since it was finished immediately, I plan to update it for the rest of my life. I would like to add interesting skills and careers."],
            "setalab": ["https://ks.mi.s.osakafu-u.ac.jp/", "Seta Laboratory", "Wordpress / CSS / PHP", "The official website of his laboratory, which is available in English as well as Japanese, provides useful information on daily life and events to alumni and students of the university."],
            "katsuLab": ["sites/katsu-lab/html/home.html", "KATSU LAB", "HTML / CSS", "My own blog site with the image of a laboratory. At that time, I didn't have the ability to use JavaScript, so I managed to enable dynamic expression using only CSS．The website was designed from scratch, with the goal of creating a site that I had never seen before.I made a presentation in front of several web designers I knew and received high praise, and many of the parts are also used in this portfolio."],
            "karadafull": ["http://karadafull.sakura.ne.jp/", "フィットネスジム カラダフル", "HTML / CSS / Javascript", "The official fitness gym website created at the request of an acquaintance. It also serves as a practice for SCSS. Since the target age of users is wide, we chose a familiar color as the main color of the site. Also, for the first time, I made it responsive without using BootStrap, and it was a good opportunity to study SEO."],
            "underground": ["", "Home's bar UnderGround", "HTML / CSS / Javascript(jQuery)", "The name and the photos used are based on the bar where he actually worked. This site was created for practicing jQuery, and uses a mechanism to easily create and add drink menus. Regarding the design, I created it with reference to the header of the official website of Apple Business, and the contrast of black and dark orange creates a calm atmosphere as a whole page."]
        },
        "webServices": "Web Services",
        "webService":
        {
            "ride": ["sites/ride/index.php", "RIDE", "HTML / CSS / PHP / MySQL", "A service that I created with the intention of improving efficiency when conducting research. An abbreviation for Research Integrated Development Environment, you can organize research materials on this site. For example, you can refer to and edit the main points and summaries of MT related to each research in the flow of each project. Research papers can also be classified and saved by field, and can be referred to in team units."],
            "pytweet": ["", "Pytweet", "Python(Flask) / HTML / CSS / SQLite", "I wanted to create a web service using Python, so I tried to create an SNS like Twitter. The framework used was Flask, which was deployed using Heroku to provide services on the Web. Like Twitter, it has functions such as tweet, comment, and follow, as well as registration, login, and profile editing functions."],
            "toyou": ["", "To You", "Wordpress / CSS / PHP", "This is an EC site of a fictitious company 'To You', which was created based on the idea that Japan has a culture of 'giving things to others' such as summer greetings and midsummer gifts. The feature of the service provided on this site is that you can only buy things for others, not as a gift for yourself. It can be expected that there will be some work that will not damage the culture of young people, such as leaving New Year's cards. In addition, this site is a product created as a practice of web design with Wordpress, and although it is possible to set the price for adding / deleting products, the service part is incomplete because the actual trading function was abandoned in the middle."],
            "mdp": ["", "MDP", "Javascript(Node.js, NestJS) / MySQL", "This is one of the projects I was involved in during my internship at a Cambodian company. This was my first corporate project, and it was a Web service created by team development. This service acts as an intermediary between clients and vendors, and processes and records the details of product management and transactions in general. We used RESTful API and it was new first specification to me, so I studied a lot. The reviews of veteran engineers were also rigorous, and it was an experience that felt like a professional work."],
            "rit": ["", "RIT", "Javascript(Vue.js, Nuxt.js) / MySQL", "This is one of the projects that I was involved in during my internship at a company in Cambodia. It is a system to centrally manage moving companies, introduction companies, and customers by project. I was in charge of the design of a large DB consisting of about 20 tables. It took me a long time to create it, as I was studying and editing it, but it increased my knowledge of DBs, and I expect it will be useful when I create web services in the future."],
            "wiki": ["", "社内Wiki", "wiki.js / Docker / GCE", "カンボジアの企業にてインターン期間中に自身が携わらせていただいたプロジェクトの一つである．"],
            "mms": ["", "前向き研究 問診・管理システム", "Javascript(Node.js, NestJS)", "カンボジアの企業にてインターン期間中に自身が携わらせていただいたプロジェクトの一つである．"],
            "milbon": ["", "ヘアケア・肖像権等同意書管理システム", "PHP(Laravel), Sass(BEM)", "カンボジアの企業にてインターン期間中に自身が携わらせていただいたプロジェクトの一つである．"]
        },
        "educationalSystems": "Educational Systems",
        "educationalSystem":
        {
            "kotowaza": ["Abstraction Skill T System", "Javascript(Node.js) / HTML / CSS", "On this system, learners (users) are asked to assemble disparate concepts like puzzles, reproduce proverbs, and apply them to concrete examples. The ability to be asked in the process is the ability to abstract and materialize. A mechanism in which the system points out mistakes in activities and teaches advice according to the learners' mistakes to advance learning."],
            "nazokake": ["Reasoning Skill T System", "HTML / CSS / PHP / MySQL", "Ask the learner (user) to create a mystery on this system. Here, it is defined as the result of good analogy = good analogy ability, and by structurally comparing good analogy and bad analogy, we aim to improve our own analogy ability. In addition, we thought that it would be possible to follow the thinking process of others by asking questions and answering the mystery created by others as a question format, which would contribute to the improvement of creativity."],
            "handcal": ["Hand Calculator", "Scratch / AutoML", "ビジュアルプログラミングと機械学習を用いて、幼児の手計算を支援するシステムを開発した。"]
        },
        "papers": "Research Paper",
        "paper":
        {
            "kotowaza": ["Abstraction Skill Training System by creating concept of proverb", "Javascript(Node.js) / HTML / CSS", "Analogical thinking is one of the important skills to make creative activities meaningful. On the other hand, there are few learning opportunities that consciously require the exercise of such analogical thinking, and analogical thinking. There is not enough learning material to cultivate thinking ability. One of the reasons is that the thinking process in analogical activities is not clear, and it is difficult to realize highly accurate support that contributes to this improvement. Even in the analogical process, we will consider support that focuses on abstraction and materialization activities that are considered to be common. In this research, we focus on how to use words as learning materials. The analogy gives the conceptual structure of general psychology and lessons a linguistic expression that is easy to remember and recall. The reason for using the analogy as a learning material is to abstract the structure of the things that we are currently facing. This is because we thought that we could find homogeneity between the analogical act of embodying another case of structurally the same type, and the generalization that captures the conceptual structure of a specific event and the application of the slogan. Therefore, in this study, the learner's abstraction and concreteness are achieved through a series of cognitive activities in which the analogy is conceptually understood (abstraction) and applied to the case (concrete), or conversely, the case is generalized and applied to the case. The purpose is to develop a system that fosters conversion skills."],
            "nazokake": ["Reasoning Skill Training System by creating meaning Nazokake", "HTML / CSS / PHP / MySQL", "Just as the conveyor belt sushi system that was inspired by the conveyor belt operating in a beer factory was created, the analogical thinking ability to utilize the knowledge gained in one context in another context makes creative activities meaningful. It is an important skill for making sushi. On the other hand, there are not many learning opportunities that require the exercise of such analogical thinking as an explicit task, and the preparation of learning materials to cultivate analogical thinking ability is sufficient. Unprepared. Therefore, in this study, we developed an analogical thinking training system through mystery as an issue that requires the exercise of analogical thinking."]
        },
        "posters": "Research Poster",
        "poster":
        {
            "nursing":["遠隔Bereavement Careにおける共感成立過程の解明に向けた検討", "創造的活動を有意味なものにする上で重要なスキルの1つとして類推思考力がある.一方で，このような類推思考の発揮が意識的に要求される学習機会はほとんどなく，類推思 考力を養うような学習教材の整備も十分でない.その理由の一つに類推活動における思考過程が判然とせず，この向上に資する確度の高い支援を実現しにくいことが考えられる.そこで，判然とはしない類推過程であっても，共通して行われていると考えられる抽象化・具体化活動に焦点化した支援を 検討する.本研究では学習教材として諺(ことわざ)の使用 方法に着目した.諺は一般的心理や教訓の概念構造に，記憶や想起が容易な言語表現を与えている.諺を学習教材とした理由は，現在直面している事柄の構造を抽象化して捉え，構造的に同型の別の事例に具体化するという類推行為と，ある具体的事象の概念構造を捉えた一般化と諺の適用との間 に同型性を見いだすことができると考えたからである.そこで，本研究では諺の概念的な理解(抽象化)と事例への適用 (具体化)，あるいは逆に，事例を一般化して諺に当てはめる一連の認知活動を通して，学習者の抽象化・具体化スキルを育成するシステムを開発することを目的とする."]
        },
        "dramas": "Drama",
        "drama":
        {
            "aku": ["Evil army should be Happy", "Scriptwriter / Director / Actor", "The hero who longs for a hero and cannot easily get a regular job. Due to pressure from others, I applied for a hero recruitment when this was my last chance, but I mistakenly became a member of the evil army! ?? It has become an evil army that is the exact opposite of the hero, but there are various circumstances in which it also fights against the evil army. This is a story that focuses on the 'army of evil' that should not be in the spotlight, and the unexpected ending ..."],
            "semi": ["Cicada", "Movie director / Stage artist", "'What if I could live for another seven days? '. The main character, Nanami, who is not obsessed with living, committed suicide, but what appeared in front of her was the strange god of death, Sicade, who told her that she would be given seven days to live. Of course, Nanami, who is not interested in life, does not show interest, but ... This is a story about life, in which the main story, in which Nanami is the key, and several sub-stories are intertwined. What is each 'meaning of life'?"],
            "android": ["AND-ROID", "Movie director / Stage artist", "The stage is a robot school. They are classified according to the performance of this robot, and the main character Lloyd in the lowest class has no characteristics, and he did not know what kind of robot he was. Although my friends have special skills, they have many drawbacks and have always been ridiculed by excellent robots in other classes. What came into my mind was the story of a contest held in the school. Lloyd and the others decide to struggle to look back at the contest."],
            "momojiro": ["Momojiro", "Scriptwriter / Director / Actor", "Once upon a time, an old man and an old woman lived in a certain place. An old tale 'Momotaro' that everyone knows, starting with an old man going to the mountains to mow the lawn, and an old woman going to the skin to do the laundry. In this play, we go back to the old days and explore the secret of how these two met. The stage is Kibi Dango Seisakusho, where the main character Momojiro serves. Appearing there are future grandmother candidates, four heroines. Who will be the future grandmother? Love suspense with laughter and emotion!"],
            "higashi": ["Sunset in East", "Vice scriptwriter / Movie directer", "Fuyukawa, a hot-blooded detective, will form a combination with Natsume, an eccentric detective. An unsolved esoteric case challenged by such a combination. The suspect is a friend of the victim who has a perfect alibi. Will Fuyukawa and Natsume uncover a cleverly crafted trick? ?? And what is the justice for Fuyukawa that is required when the truth of the case is reached?"]
        }
    }
}
